## Plan Result (sbox_landing)




<pre><code>Plan: 6 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-sbox-User-Owner-dominic.leary@justice.gov.uk&#34;]
  * azurerm_role_assignment.roles[&#34;00-ingest00-logic-sbox-User-Owner-prasanna.krishnan@justice.gov.uk&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.database.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;logic&#34;]
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.roles["00-ingest00-logic-sbox-Group-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logic-sbox-Group-Storage-Blob-Data-Owner-DTS DLRM Data Ingestion Admin (env:sandbox)"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logic-sbox-User-Owner-dominic.leary@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8c3e64ea-b92f-4e47-b6d9-7abbb1df48e3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.roles["00-ingest00-logic-sbox-User-Owner-prasanna.krishnan@justice.gov.uk"] will be created
  + resource "azurerm_role_assignment" "roles" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c064d48d-defc-4a2f-afba-5c8571d44de4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.database.windows.net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
      + id                    = (known after apply)
      + name                  = "ingest00-database-data-landing-link-sbox"
      + private_dns_zone_name = "privatelink.database.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox"
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["logic"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ingest00-logic-sbox"
      + tags     = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-sbox"
        name                                 = "ingest00-metadata-mssql-sbox"
        tags                                 = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (11 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ object_id                   = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
          ~ tenant_id                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mysql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_virtual_network.this["vnet"] will be updated in-place
  ~ resource "azurerm_virtual_network" "this" {
      ~ address_space           = [
            # (3 unchanged elements hidden)
            "10.247.6.0/24",
          - "10.247.7.0/24",
          - "10.247.8.0/24",
        ]
        id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox"
        name                    = "ingest00-vnet-sbox"
        tags                    = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (6 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.runtimes_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_databricks.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_databricks.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["curated"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["landing"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 6 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":32,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->